/* No comment provided by engineer. */
"%@ (Disabled: %@)" = "%1$@ (Відключено: %2$@)";

/* No comment provided by engineer. */
"%@ can't be empty" = "%@ не може бути пустим";

/* No comment provided by engineer. */
"(Tap to edit, hold to re-order)" = "(Натисніть для зміни, утримуйте для переупорядковування)";

/* No comment provided by engineer. */
"(Use Default)" = "(Використовувати за замовчуванням)";

/* SettingsViewController */
"About" = "Про";

/* No comment provided by engineer. */
"Add Bookmark" = "Додати Закладку";

/* No comment provided by engineer. */
"All rules" = "Усі правила";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "Дозволити сторонні клавіатури";

/* SecurityViewController */
"Allow hosts to access WebRTC functions." = "Дозволити хостам доступ до функцій WebRTC.";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "Дозволити хостам постійно зберігати файли cookie та локальні бази даних.";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "Дозволити хостам HTTPS завантажувати ресурси сторінок з не-HTTPS хостів (корисно для RSS та інших агрегаторів)";

/* SecurityViewController */
"Allow Persistent Cookies" = "Дозволити постійні файли cookie";

/* No comment provided by engineer. */
"Allow this page to close its tab?" = "Дозволити цій сторінці закрити вкладку?";

/* No comment provided by engineer. */
"An error occurred downloading image %@" = "Виникла помилка при завантаженні зображення %@";

/* Donate Scene. */
"Are you sure you want to send a %@ tip?" = "Are you sure you want to send a %@ tip?";

/* No comment provided by engineer. */
"Authentication Required" = "Необхідна аутентифікація";

/* SettingsViewController */
"Auto-Complete Search Results" = "Автодоповнювати результати пошуку";

/* No comment provided by engineer. */
"Block external LAN requests" = "Блокувати зовнішні LAN запити";

/* No comment provided by engineer. */
"Blocked 3rd-Party Hosts" = "Блокувати сторонні хости";

/* No comment provided by engineer. */
"Bookmarks" = "Закладки";

/* Cancel
   Cancel action */
"Cancel" = "Скасувати";

/* SettingsViewController */
"Changing this option requires restarting the app." = "Для зміни цієї опції необхідно перезапустити програму.";

/* SettingsViewController */
"Choose, how long app remembers open tabs." = "Налаштування запам'ятовування відкритих вкладок.";

/* No comment provided by engineer. */
"Close Tab" = "Закрити вкладку";

/* No comment provided by engineer. */
"Confirm" = "Підтвердити";

/* Donate Scene. */
"Confirm %@" = "Confirm %@";

/* Donate Scene. */
"Confirm Purchase" = "Confirm Purchase";

/* SecurityViewController */
"Content Policy" = "Політика контенту";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "Файли cookie та локальні дані сховища з хостів, які не перебувають в білому списку, будуть очищені навіть з відкритих вкладок.";

/* No comment provided by engineer. */
"Copy URL" = "Копіювати URL-адресу";

/* No comment provided by engineer. */
"Create New Tab" = "Створити нову вкладку";

/* No comment provided by engineer. */
"Custom settings" = "Налаштування користувача";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "Свій агент користувача або пусте значення для використання агенту за замовчуванням.";

/* No comment provided by engineer. */
"Default Settings" = "Налаштування за замовчуванням";

/* No comment provided by engineer. */
"Disable" = "Від'єднати";

/* No comment provided by engineer. */
"Disabled: %@" = "Вимкнено: %@";

/* Donate Scene. */
"Donate" = "Пожертва";

/* No comment provided by engineer. */
"Done" = "Зроблено";

/* No comment provided by engineer. */
"Double-tap to dismiss pop-up window." = "Двічі торкніться, щоб закрити спливаюче вікно.";

/* No comment provided by engineer. */
"Edit Bookmark" = "Редагувати закладку";

/* No comment provided by engineer. */
"Enable" = "Увімкнути";

/* No comment provided by engineer. */
"Enter the details of the URL to bookmark:" = "Введіть інформацію про URL-адресу в закладці:";

/* No comment provided by engineer. */
"Enter the host/domain to define settings for" = "Введіть хост/домен, щоб визначити параметри для";

/* No comment provided by engineer. */
"Error" = "Помилка";

/* No comment provided by engineer. */
"Fill with 1Password" = "Заповнити за допомогою 1Password";

/* No comment provided by engineer. */
"Focus URL Field" = "Фокус URL поля";

/* Donate Scene. */
"Fund Development" = "Fund Development";

/* No comment provided by engineer. */
"Bridge Configuration" = "Конфігурація мосту";

/* No comment provided by engineer. */
"Tor connection failure" = "Помилка з'єднання Tor";

/* No comment provided by engineer. */
"__CONNECTION_FAILURE_DESCRIPTION__" = "Браузер Onion втратив зв'язок з мережею анонімності Tor і не зможе відновити зв'язок. Це могло статися, якщо Onion Browser перейшов у фоновий режим або якщо пристрій пішов спати, поки був активний Браузер Onion.\n\nБудь ласка, закрийте застосунок та повторіть спробу. Якщо вам потрібно закріпити поточну сторінку або зберегти інформацію з поточної сторінки, ви можете натиснути 'ОК', щоб залишитися в застосунку без можливості роботи з мережею.";

/* No comment provided by engineer. */
"Quit App" = "Вийти з програми";

/* No comment provided by engineer. */
"Go Back" = "Повернутися";

/* No comment provided by engineer. */
"Go Forward" = "Йти далі";

/* SecurityViewController */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications." = "Включити нестандартну обробку натискань на посилання, щоб уникнути випадкового відкриття сторонніх додатків.";

/* No comment provided by engineer. */
"Host Settings" = "Налаштування хосту";

/* No comment provided by engineer. */
"Host/domain" = "Хост/домен";

/* No comment provided by engineer. */
"Hosts" = "Хости";

/* No comment provided by engineer. */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* No comment provided by engineer. */
"HTTPS Everywhere Rules" = "Правила HTTPS Everywhere";

/* No comment provided by engineer. */
"Ignore for this host" = "Ігнорувати для цього хосту";

/* No comment provided by engineer. */
"Ignore TLS errors" = "Ігнорувати помилки TLS";

/* No comment provided by engineer. */
"Invalid email address" = "Невірна адреса електронної пошти";

/* Donate Scene. */
"Loading in-app purchase data…" = "Loading in-app purchase data…";

/* No comment provided by engineer. */
"Log In" = "Увійти";

/* No comment provided by engineer. */
"Manage Bookmarks" = "Управління закладками";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "Необхідна мінімальна версія TLS для хостів щоб погодити з'єднаня HTTPS.";

/* SettingsViewController */
"Miscellaneous" = "Різноманітний";

/* SettingsViewController */
"Mute Audio with Mute Switch" = "Кнопка для виключення аудіо";

/* No comment provided by engineer. */
"No" = "Ні";

/* No comment provided by engineer. */
"No XHR/WebSocket/Video connections" = "Немає під'єднань XHR/WebSocket/Video";

/* No comment provided by engineer. */
"OK" = "Гаразд";

/* No comment provided by engineer. */
"Open" = "Відкрити";

/* No comment provided by engineer. */
"Open (normal browsing mode)" = "Відкрити (звичайний режим перегляду)";

/* No comment provided by engineer. */
"Open in a New Tab" = "Відкрити у новій вкладці";

/* No comment provided by engineer. */
"Open in Background Tab" = "Відкрити у фоновій вкладці";

/* No comment provided by engineer. */
"Open in Safari" = "Відкрити у Safari";

/* No comment provided by engineer. */
"Other" = "Інше";

/* No comment provided by engineer. */
"Page bookmarked" = "Сторінка з закладками";

/* No comment provided by engineer. */
"Page Name (leave blank to use URL)" = "Назва сторінки (залиште поле порожнім для використання URL-адреси)";

/* Password */
"Password" = "Пароль";

/* Donate Scene. */
"Payment Sent" = "Payment Sent";

/* No comment provided by engineer. */
"Privacy" = "Конфіденційність";

/* No comment provided by engineer. */
"Pull to Refresh Page" = "Потягніть, щоб оновити сторінку";

/* Donate Scene. */
"Purchase Failure" = "Purchase Failure";

/* SettingsViewController */
"Rate on App Store" = "Оцініть в App Store";

/* No comment provided by engineer. */
"Refresh" = "Оновити";

/* SettingsViewController */
"Report a Bug" = "Повідомити про помилку";

/* No comment provided by engineer. */
"Resources loaded from external hosts will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "Ресурси, завантажені з зовнішніх хостів, будуть заблоковані від завантаження елементів сторінки або створення запитів до хостів LAN (192.168.0.0/16, 172.16.0.0/12 та ін.)";

/* No comment provided by engineer. */
"Resources loaded from this host will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "Ресурси, завантажені з цього хоста, будуть заблоковані від завантаження елементів сторінки або створення запитів до хостів LAN (192.168.0.0/16, 172.16.0.0/12 та ін.)";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages" = "Обмеження ресурсів, завантажених з веб-сторінок";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages at this host" = "Обмеження ресурсів, завантажених з веб-сторінок на цьому хості";

/* No comment provided by engineer. */
"Rules in use on current page" = "Правила, що використовуються на цій сторінці";

/* No comment provided by engineer. */
"Save Image" = "Зберегти зображення";

/* SettingsViewController */
"Search Engine" = "Пошукова система";

/* No comment provided by engineer. */
"Security" = "Безпека";

/* SettingsViewController */
"Send Do-Not-Track Header" = "Відправка заголовку 'не відслідковувати'";

/* No comment provided by engineer. */
"Settings" = "Налаштування";

/* No comment provided by engineer. */
"Share URL" = "Надіслати URL-адресу";

/* No comment provided by engineer. */
"Show Bookmarks" = "Показати закладки";

/* Donate Scene. */
"Sorry, in-app purchase is disabled on your device!" = "Sorry, in-app purchase is disabled on your device!";

/* SettingsViewController */
"Stop Auto-Complete at First Dot" = "Автодоповнення до першої точки";

/* No comment provided by engineer. */
"Strict (no JavaScript, video, etc.)" = "Строго (без JavaScript, відео та ін.)";

/* Donate Scene. */
"Support Onion Browser Development" = "Support Onion Browser Development";

/* No comment provided by engineer. */
"Switch to Tab %d" = "Перейдіть на вкладку %d";

/* SettingsViewController */
"Tab Security" = "Вкладки по безпеці";

/* No comment provided by engineer. */
"These settings will apply to this host and all hosts under it (e.g., \"example.com\" will apply to example.com and www.example.com)" = "Ці налаштування будуть застосовані до цього хосту та всіх хостів під ним (наприклад, \"example.com\" буде застосовано до example.com та www.example.com).";

/* No comment provided by engineer. */
"These settings will be used as defaults for all hosts unless overridden" = "Ці налаштування будуть використані як значення за замовчуванням для усіх хостів, якщо їх не буде змінено";

/* Donate Scene. */
"Tip: %@" = "Tip: %@";

/* SettingsViewController */
"TLS 1.2 Only" = "Тільки TLS 1.2";

/* SettingsViewController */
"TLS 1.2, 1.1 or 1.0" = "TLS 1.2, 1.1, або 1.0";

/* No comment provided by engineer. */
"TLS certificate chain verification error (self-signed certificate?)" = "Помилка перевірки ланцюжка сертифікатів TLS (самоподпісанний сертифікат?)";

/* No comment provided by engineer. */
"TLS handshake failed" = "Рукостискання TLS не вдалося";

/* No comment provided by engineer. */
"TLS protocol error" = "Помилка протоколу TLS";

/* SettingsViewController */
"TLS Version" = "Версія TLS";

/* No comment provided by engineer. */
"Universal Link Protection" = "Універсальний захист посилань";

/* No comment provided by engineer. */
"Unknown Organization" = "Невідома організація";

/* No comment provided by engineer. */
"URL" = "URL";

/* No comment provided by engineer. */
"URL Blocker" = "Блокувальник URL-адрес";

/* SecurityViewController */
"User Agent" = "Користувацький агент";

/* No comment provided by engineer. */
"User disabled" = "Користувач від'єднаний";

/* No comment provided by engineer. */
"Using defaults" = "Використання за замовчуванням";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* SettingsViewController */
"When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\"" = "Якщо не включити, весь текст в рядку пошуку (якщо він не починається на \"http\") буде відправлятися в пошуковий сервіс";

/* No comment provided by engineer. */
"XLFormViewController_ValidationErrorTitle" = "Помилка";

/* No comment provided by engineer. */
"Yes" = "Так";

/* Donate Scene. */
"You most recently donated %@ on %@." = "You most recently donated %@ on %@.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* Donate Scene. */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
